/*
 2-1 문자열 보간법 사용
 문자열 보간법 String Interpolation
 : 변수 또는 상수 등의 값을 문자열 내에 나타내고 싶을때 사용
 */

import UIKit

let word:String="SWIFT"
print("Hello, \(word)")
dump(word)
//dump()는 출력하려는 인스턴스의 자세한 내부 콘텐츠까지 출력한다.

/*
 2-2 한 줄 주석
 */
//한 줄 주석 달기

/*
 2-3 여러 줄 주석
 여러 줄 주석 달기
 */

/*
 2-4 중첩 주석
 /*
 스위프트는 여러 줄 주석 안에 여러 줄 주석 또는 한 줄 주석 넣는 중첩 주석을 지원
 */
 */

/*
 + 퀵헬프 사용하기
 퀵헬프: 레퍼런스 문서의 요약된 내용을 보여주는 기능
 커서+option, 클릭
 주석을 퀵헬프 기능을 통해 볼 수 있게 하려면 마크업 문법을 사용해 작성
 
2-5 퀵헬프를 위한 마크업
 잘 안되므로 나중에 다시 알아보고 연습해보도록 한다..
 */


